<?php 
/**
 * 三元运算符。
 * $a = 7;
 * $b = 3;
 * 判断 $a >$b
 * 如果条件为真 那么$n =1；
 * 否则 $n = 2;
 * 
 * 
 */
$a = 7;
$b = 5;
if($a >$b){
    $n = 1;
}else{
    $n = 2;
}
echo $n;
echo "<br />";
$a = 7;
$b = 5;
//使用三元运算法，节省很多代码。
$a>$b?$n = 1:$n = 2;
echo $n."<br />";
$a = 7;
$b = 5;
//再次简化  最简单，推荐写法。
$n = $a > $b?1:2;
echo $n;

echo "<br />";
/**
 *  终极简化，php5.3版本以上才可以。 不完全，
 *   $n = $a>$b?:2; 实际等于 $a>$b?true:2; true是布尔值自动转化成1的结果。
 * 如果是字符串
 * 那么是什么就输出什么。
 * */
$a = 7;
$b = 5;
$n = $a>$b?:2;
echo $n;

?>